In [1]:
# initial imports
import pandas as pd
from path import Path

In [2]:
# Load data
file_path = Path("../Resources/loans_data.csv")
loans_df = pd.read_csv(file_path)
loans_df.head()

   amount  term      month  age             education  gender  bad
0    1000    30       June   45  High School or Below    male    0
1    1000    30       July   50              Bachelor  female    0
2    1000    30     August   33              Bachelor  female    0
3    1000    15  September   27               college    male    0
4    1000    30    October   28               college  female    0

In [7]:
# Binary encoding using Pandas
loans_binary_encoded = pd.get_dummies(loans_df, columns=["gender", "education"])
loans_binary_encoded.head()

,amount,term,month,age,bad,gender_female,gender_male,education_Bachelor,education_High School or Below,education_Master or Above,education_college
0,1000,30,June,45,0,0,1,0,1,0,0
1,1000,30,July,50,0,1,0,1,0,0,0
2,1000,30,August,33,0,1,0,1,0,0,0
3,1000,15,September,27,0,0,1,0,0,0,1
4,1000,30,October,28,0,1,0,0,0,0,1

In [11]:
# Months dictionary
months_num = {
    "January": 1,
    "February": 2,
    "March": 3,
    "April": 4,
    "May": 5,
    "June": 6,
    "July": 7,
    "August": 8,
    "September": 9,
    "October": 10,
    "November": 11,
    "December": 12,
}

In [12]:
# Months' names encoded using the dictionary values
loans_binary_encoded["month_num"] = loans_binary_encoded["month"].apply(lambda x: months_num[x])
loans_binary_encoded.head()

,amount,term,month,age,bad,gender_female,gender_male,education_Bachelor,education_High School or Below,education_Master or Above,education_college,month_num
0,1000,30,June,45,0,0,1,0,1,0,0,6
1,1000,30,July,50,0,1,0,1,0,0,0,7
2,1000,30,August,33,0,1,0,1,0,0,0,8
3,1000,15,September,27,0,0,1,0,0,0,1,9
4,1000,30,October,28,0,1,0,0,0,0,1,10

In [13]:
loans_binary_encoded = loans_binary_encoded.drop("month", axis=1)
loans_binary_encoded.head()

,amount,term,age,bad,gender_female,gender_male,education_Bachelor,education_High School or Below,education_Master or Above,education_college,month_num
0,1000,30,45,0,0,1,0,1,0,0,6
1,1000,30,50,0,1,0,1,0,0,0,7
2,1000,30,33,0,1,0,1,0,0,0,8
3,1000,15,27,0,0,1,0,0,0,1,9
4,1000,30,28,0,1,0,0,0,0,1,10